#### 1. Import pandas library

In [2]:
%pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     |████████████████████████████████| 43 kB 777 kB/s eta 0:00:01
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine

#### 2. Import pymysql and sqlalchemy as you have learnt in the lesson of importing/exporting data

#### 3. Create a mysql engine to set the connection to the server. Check the connection details in [this link](https://relational.fit.cvut.cz/dataset/Stats)

In [5]:
path = 'mysql+pymysql://guest:relational@relational.fit.cvut.cz:3306/stats'
engine = create_engine(path)

#### 4. Import the users table

In [12]:
df_users = pd.read_sql_query('SELECT * FROM users', engine)

In [13]:
df_posts = pd.read_sql_query('SELECT * FROM posts', engine)

#### 5. Rename Id column to userId

In [14]:
df_users.rename(columns={"Id":"userId"}, inplace=True)
df_posts.rename(columns={"Id":"postId", 'OwnerUserId':'userId'}, inplace=True)

#### 6. Import the posts table.

#### 7. Rename Id column to postId and OwnerUserId to userId

#### 8. Define new dataframes for users and posts with the following selected columns:
    **users columns**: userId, Reputation,Views,UpVotes,DownVotes
    **posts columns**: postId, Score,userID,ViewCount,CommentCount

In [15]:
df_users_f = df_users[['userId', 'Reputation','Views','UpVotes','DownVotes']].copy()
df_posts_f = df_posts[['postId', 'Score','userId','ViewCount','CommentCount']].copy()

#### 8. Merge both dataframes, users and posts. 
You will need to make a [merge](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.merge.html) of posts and users dataframes.

In [17]:
df_merge= df_users_f.merge(df_posts_f, on='userId')
df_merge

,userId,Reputation,Views,UpVotes,DownVotes,postId,Score,ViewCount,CommentCount
0,-1,1,0,5007,1920,2175,0,NaN,0
1,-1,1,0,5007,1920,8576,0,NaN,0
2,-1,1,0,5007,1920,8578,0,NaN,0
3,-1,1,0,5007,1920,8981,0,NaN,0
4,-1,1,0,5007,1920,8982,0,NaN,0
...,...,...,...,...,...,...,...,...,...
90579,55734,1,0,0,0,115352,0,16.0,0
90580,55738,11,0,0,0,115360,2,40.0,4
90581,55742,6,0,0,0,115366,1,17.0,0
90582,55744,6,1,0,0,115370,1,13.0,2
90583,55746,106,1,0,0,115376,1,5.0,2

#### 9. How many missing values do you have in your merged dataframe? On which columns?

In [18]:
df_merge.isnull().sum()

userId              0
Reputation          0
Views               0
UpVotes             0
DownVotes           0
postId              0
Score               0
ViewCount       48396
CommentCount        0
dtype: int64

In [20]:
df_merge.shape

(90584, 9)

In [24]:
df_merge.ViewCount.count()

42188

In [25]:
(df_merge.ViewCount.isnull().sum())/(df_merge.ViewCount.count()+df_merge.ViewCount.isnull().sum())

0.5342665371368012

#### 10. You will need to make something with missing values.  Will you clean or filling them? Explain. 
**Remember** to check the results of your code before passing to the next step

In [26]:
df_merge.drop('ViewCount', axis = 1, inplace = True)

#### 11. Adjust the data types in order to avoid future issues. Which ones should be changed?

#### Bonus: Identify extreme values in your merged dataframe as you have learned in class, create a dataframe called outliers with the same columns as our data set and calculate the bounds. The values of the outliers dataframe will be the values of the merged_df that fall outside that bounds. You will need to save your outliers dataframe to a csv file on your-code folder.